import pygame
import time
import os
import sys
import random
from colorama import init, Fore, Style

# Ініціалізація pygame для музики
pygame.mixer.init()

# Завантажуємо музику
pygame.mixer.music.load("C:\\Users\\User\\Desktop\\Igra\\music\\menu_music.wav")

# Встановлюємо гучність (від 0.0 до 1.0), 0.1 — дуже тихо
pygame.mixer.music.set_volume(0.1)

# Відтворюємо музику в циклі (немає кінця)
pygame.mixer.music.play(-1, 0.0)

# Функція для виведення кольорового тексту
def color_text(text='Автор Кабілов Матвій', color=Fore.BLUE):
    print(color + text + Style.RESET_ALL)

# Очищення екрану
def clear_screen():
    os.system('cls' if os.name == 'nt' else 'clear')

# Головне меню
clear_screen()
color_text("Метро: Останній Сигнал", color=Fore.GREEN)
color_text("Дисклеймер: Ця гра не є продовженням Метро 2033 ця гра у розряді а що було якщо б тому якщо ви проходите метро це не є канонічним продовженням метро 2033", color=Fore.YELLOW)
color_text("Головне меню", color=Fore.GREEN)
color_text("Почати гру - 1", color=Fore.GREEN)
color_text("Вийти - 2", color=Fore.GREEN)

menu = input(">> ")

if menu == "1":
    print("Починаємо гру...")  
    time.sleep(3)
    clear_screen()
elif menu == "2":
    print("Вихід з гри...")
    pygame.mixer.music.stop()  # Зупиняємо музику при виході
    exit()
else:
    print("Невірний вибір помилка 2033.")
    pygame.mixer.music.stop()  # Зупиняємо музику при помилці
    exit()

# Початок гри
print("Ти Артем: Ти прокидаєшся у своїй кімнаті у Д6 після випадка на Останкіньскій вежі")
time.sleep(1.5)
print("Тобі треба йти на поверхню щоб передивитись там обстановку після ядерної зими")
time.sleep(1.5)
print("Ти взяв <Калаш револьвер та убойник> потім взяв медикаменти та фільтрів на 1-ну годину")
time.sleep(1.5)
print("<Ти вийшов на поверхню>")
print("<Ти піднявся на вежу та поставив радіо>")

radio = int(input("Переключайся на ефіри між 1 та 10: "))
rv = random.randint(1, 10)
while radio != rv:
    print("На цій передачі тиша")
    radio = int(input("Переключайся на ефіри між 1 та 10: ")) 

print("<Ти почув сигнал> Хто небудь допоможіть це база 47 обьект метро 2")
time.sleep(1.5)

# Подальший розвиток гри...


vibor = int(input("що зробиш 1 піти та підготуватись у Д6 Або 2 Одразу піти: "))
if vibor == 1:
    print("<Ти швидко прийшов до Д6 та почав збирати речі>")
elif vibor == 2:
    print("Ти пішов та зустрів отряд червоних і вони тебе вбили")
    time.sleep(1.5)
    exit()
else:
    print("Неправильний вибір")
    exit()

print("<Ти пішов до архіва та знайшов документ у якому говорится де знаходится база 47>")
vibor = int(input("Ти зустрів Анну вона питає що ти робив 1 просто копався 2 сказати правду: "))
if vibor == 1:
    print("Анна: Ну добре повірю")
elif vibor == 2:
    print("<Вона побіжала росказувати мельнику>")
    time.sleep(1.5)
    print("<вона прийшла з мельником та мельник повісив на тебе охрану яка дивится щоб ти нікуди не ходив>")
    time.sleep(2)
    exit()

karmagood = 0
print("<по пути до тунелей ти зустрів безхатька він просить у тебе патрон>")
time.sleep(1.5)
vibor = int(input("1 Дати 10 патронів 2 Уйти: "))
if vibor == 1:
    print("Безхатько: Дякую вам добрий чоловік")
    karmagood += 1
elif vibor == 2:
    print("<Ти просто пройшов мимо>")

time.sleep(1.5)
print("<Ти дішов до тунелю та почав йти по ньому>")
time.sleep(1.5)
print("<Ти почув плачь у техкімнати>")
vibor = int(input("Що зробиш 1 Зайдешь 2 Пройдешь мимо: "))
if vibor == 1:
    karmagood += 1
    print("<Там ти побачив дитину яка плакала ти спитав що сталося він сказав> Дитина: Я загубив свою маму...")
    time.sleep(1.5)
    print("<Ти взяв його на плечі та пішов з ним>")
    print("<ти зустрів 5 стражів(такі мутанти)>")
    vibor = int(input("Що зробив 1 Вбьешь їх всіх 2 Почекаєшь поки вони пройдуть: "))
    if vibor == 1:
        print("<Ти вбив їх всіх з дробовика убойника>")
        karmagood -= 1
    elif vibor == 2:
        print("<Вони просто пройшли мимо>")
        karmagood += 1
    print("<Ти знайшов группу спарти та віддав їм дитину>")
    time.sleep(1.5)
elif vibor == 2:
    karmagood -= 1
    print("<Ти пройшов мимо>")
    print("<ти зустрів группу спарти і вони питають чи не бачив ти дитину ти їм сказав що вона у техкімнаті>")
    print("<Вони пішли далі та не встигли>")
    time.sleep(1.5)

print("<Ти йдешь далі по тунелю та знайшов вхід до бази 47>")
time.sleep(1.5)
print("<Біля входу ти знайшов кассетник з піснею Зірка на ім'я солнце>")
print("<Через те що вона зависла на вступі ти її вимкнув>")
print("<Ти зайшов у базу 47 там була группа спартанців вже мертвих та солдати рейха яки вбили їх>")
vibor = int(input("1 Пройти все по стелсу вирубаючи людей 2 Вбити всіх з калаша: "))
if vibor == 1:
    karmagood += 1
    print("Після того як ти вирубив усіх ти зайшов у закриту кімнату")
elif vibor == 2:
    print("Ти перестріляв усіх")
    karmagood = 0

# Кінцівка
if karmagood <= 0:
    print("<Ти зайшов та побачив там мертвих вчених>")
    time.sleep(1.5)
    print("<Потім через декілька секуннд у цю кімнату зайшов один живий солдат рейха та вбив тебе>")
    time.sleep(3)
    clear_screen()
    color_text("ПОГАНА КІНЦІВКА", Fore.RED)
else:
    print("<Ти знайшов там живих прицівників бази 47 і від них дізвався що це лабораторія на яку напали>")
    time.sleep(1.5)
    print("Ти евакуював їх всіх до Д6 та відвів до мельника зі словами Вони по радіо просили допомоги...")
    time.sleep(4)
    clear_screen()
    color_text("ГАРНА КІНЦІВКА", Fore.GREEN)
